{"meta":{"title":"Weikun Han's Website","subtitle":"","description":"","author":"Weikunu Han","url":"https://weikunhan.github.io","root":"/"},"pages":[{"title":"404 Not Found","date":"2020-05-30T08:38:52.382Z","updated":"2020-05-30T08:38:52.382Z","comments":true,"path":"404.html","permalink":"https://weikunhan.github.io/404.html","excerpt":"","text":"404 Sorry The address may be incorrect or may have been deleted"},{"title":"Awards","date":"2020-05-30T08:38:52.385Z","updated":"2020-05-30T08:38:52.385Z","comments":true,"path":"awards/index.html","permalink":"https://weikunhan.github.io/awards/index.html","excerpt":"","text":"Best Paper Award Best Student Paper Award, IEEE NANO, 2017, Tape-based flexible metallic and dielectric nanophotonic devices and metamaterials Others Magna Cum Laude Honor, Iowa State University, 2015, Ranked 1st in a class of 2015 Electrical Engineering graduates (Winter) Dean’s List Honor, Iowa State University, 2013 - 2015, Given to top ranked students"},{"title":"","date":"2020-05-30T08:38:52.386Z","updated":"2020-05-30T08:38:52.386Z","comments":true,"path":"blogs/index.html","permalink":"https://weikunhan.github.io/blogs/index.html","excerpt":"","text":""},{"title":"Projects","date":"2020-06-03T01:03:39.465Z","updated":"2020-06-03T01:03:39.465Z","comments":true,"path":"projects/index.html","permalink":"https://weikunhan.github.io/projects/index.html","excerpt":"","text":"Research Projects Coming soon Coming soon Coming soon 0pen Source Projects Tripadvisor Web Crawler Individual Projects LeetCode Python Coming soon"},{"title":"Courses","date":"2020-06-03T01:10:45.020Z","updated":"2020-06-03T01:10:45.020Z","comments":true,"path":"courses/index.html","permalink":"https://weikunhan.github.io/courses/index.html","excerpt":"","text":"Teaching Signals and Systems I, Iowa State University, Teacher Assistant, Fall 2014 Selected Courses Machine Learning, Stanford University, Coursera Introduction to Self-Driving Cars, University of Toronto, Coursera Convex Optimization, University of California Los Angeles, Spring 2018 Large Scale Social and Complex Networks: Design and Algorithms, University of California Los Angeles, Spring 2017 Large-Scale Data Mining: Models and Algorithms, University of California Los Angeles, Winter 2017 Favored Books Aurélien Géron, Hands-On Machine Learning with Scikit-Learn and TensorFlow: Concepts, Tools, and Techniques to Build Intelligent Systems, O’Reilly Media, 2017 Ian J. Goodfellow and Yoshua Bengio and Aaron Courville, Deep Learning, MIT press, 2016 Bill Chambers, Matei Zaharia, Spark: The Definitive Guide, O’Reilly Media, 2018 Jiawei Han, Micheline Kamber, Jian Pei, Data Mining: Concepts and Techniques, Morgan Kaufmann Publishers, 2012 Cormen, Thomas H. and Leiserson, Charles E. and Rivest, Ronald L. and Stein, Clifford, Introduction to Algorithms, 2001"},{"title":"Publications","date":"2020-05-30T08:38:52.390Z","updated":"2020-05-30T08:38:52.390Z","comments":true,"path":"publications/index.html","permalink":"https://weikunhan.github.io/publications/index.html","excerpt":"","text":"Selected Journal Publications Tape nanolithography: a rapid and simple method for fabricating flexible, wearable nanophotonic devicesQiugu Wang, Weikun Han, Yifei Wang, Meng Lu and Liang DongMicrosystems and Nanengineering, 4, 31, 2018 See full publication list Selected Conference Publications Tape-based flexible metallic and dielectric nanophotonic devices and metamaterialsQiugu Wang, Weikun Han, Yifei Wang, Meng Lu and Liang DongIEEE 17th International Conference on Nanotechnology (IEEE-NANO), 2017 Best Student Paper Award See full publication list"},{"title":"Wrote before deciding to proceed my Ph.D.study","date":"2020-04-29T07:00:00.000Z","updated":"2020-05-30T08:38:52.387Z","comments":true,"path":"blogs/phd_study/index.html","permalink":"https://weikunhan.github.io/blogs/phd_study/index.html","excerpt":"“⼈⽣过早的⾯对失败和挫折，要⽐不惑之年再想明⽩很多事情要好很多。“ - 韩劲谦","text":"“⼈⽣过早的⾯对失败和挫折，要⽐不惑之年再想明⽩很多事情要好很多。“ - 韩劲谦 Due to COVID-19, I have time to stop and think about what I should pursue in the next five years. I am lucky that can join one startup company (Clobotics Global), which force on use computer vision to provide end-end AI solution for global consumer goods companies. During two years of working in Clobotics Global, I was very honored to collaborate with excellent engineers and scientists to solve many real-life challenging problems. I had lots of great chances that could use what I learn from before to implement many ideas. I was lucky that I could be mentored by many excellent industry leaders. Here, I want to thank Dr. Yipeng Li, Dr. Feng Zhu, Dr. Albert Chen, and Dr. Yan Ke. At the same time, I feel there are still have a long way to go to let more and more AI-related products to walk into people’s life. For example, 1)related infrastructure development for AI-related products, 2)computation cost for model serving/training, 3)labeling cost for a supervised learning task, 4)uncertainty in the deep learning-based model for challenging computer vision tasks, 5)and more advanced and challenging real-life computer vision tasks. In the next decade, I believe people’s lifestyles will become more and more intelligent. Lots of great companies like Intel, Nvidia, and AMD are putting lots of sources on the research to provide more powerful and high-performance computing hardware. Google, Facebook, Amazon, and Microsoft are putting lots of sources on the research to provide more high-efficiency, convenient, and robust service. However, It is not enough and only a beginning, there are lots of problems that need a more effective way to solve it. Therefore, that is the reason why I want to back to the academy, dive deep, and generate a more great idea to solve those real-life challenging problems. I plan to conduct research in the following reaches area: Algorithm optimization in computer vision: Could we provide a more robust model in many other tasks such as Fast R-CNN in object detection? For example, there are many challenging subtasks in five main computer vision tasks (image classification, object detection, target tracking, semantic segmentation, instance segmentation) that need a more robust model to provide better performance. Learning method in computer vision: How could let machine study like people? Currently, people still use supervised learning as main training method for five main computer vision tasks in the industry. This training method requires tons of labeled data which cause extremely high cost for company operation. Is there exist a better way to do it? For example, “self-supervised learning” that would demonstrate more powerful compare with bringing humans into the loop for facilitating bias discovery in image datasets Advanced data in computer vision: Some challenging computer vision tasks may not solve by current popular technology. For example, base on 2D image data, how could let the machine confidently identify 16.9 fl oz Coca-Cola Soda with 12 fl oz Coca-Cola Soda from different perspectives? Therefore, I believe that we could involve 3D image data to solve those tricky problems. 2020年5⽉29号是我在公司的最后⼀天。由于疫情的原因，先后遇到⼯作、⽣活、健康⽅⾯的各种困难。正因为如此，我有时间停下来思考，未来的五年我应该追求的⽬标。 我有幸加⼊⼀家初创公司（扩博智能—借助计算机视觉为全球消费品公司提供端到端的AI解决⽅案）。在扩博智能⼯作期间，我很荣幸与优秀的⼯程师和科学家合作，利⽤计算机视觉技术解决很多现实⽣活中的难题，让生活更加智能。期间，我还有大量的机会可以利⽤以前学到的东⻄来实现许多自己想法。同时，我很幸运能得到许多杰出⾏业领袖的指导。 在这⾥，我要感谢Yipeng Li博⼠、Feng Zhu博⼠、Albert Chen博⼠和Yan Ke博⼠。 在近两年的⼯作实践中，我认为要让越来越多的AI相关产品进⼊⼈们的⽣活还有很⻓的路要⾛。 诸如：⼈⼯智能相关产品的基础设施开发；如何降低模型服务以及训练的成本；如何降低监督学习任务的数据标记成本；如何解决基于深度学习的计算机视觉模型的不确定性；以及解决更具挑战性的计算机视觉任务。 在未来的⼗年中，我相信⼈们的⽣活⽅式将变得更加智能。 许多伟⼤的公司，例如英特尔、英伟达和AMD，都在科研中投⼊了⼤量资源来开发功能更强⼤和性能更⾼的计算硬件。 ⾕歌，脸书和微软也都在研究中投⼊了⾮常多资源来提供更⾼效、更便捷、更加智能的服务。但是，这还远远不够，⽽且仅仅是⼀个开始，有许多问题需要更有效的⽅法来解决。 因此，我决定带着这些问题，开始为期5年的博⼠研究⼯作。希望在此期间，我可以对固有的基础知识有更扎实的理解、对AI相关领域有更深的看法、以及对越来越多的AI相关产品⾛⼊⽣活提供更好的解决⽅法。 最后，再次感谢公司近两年的栽培，也祝福⾃⼰在未来可以有更多的突破。 Contact Me GitHub LinkedIn Google Scholar Curriculum Vitae"},{"title":"Journal Publications","date":"2020-05-30T08:38:52.391Z","updated":"2020-05-30T08:38:52.391Z","comments":true,"path":"publications/journal_publications/index.html","permalink":"https://weikunhan.github.io/publications/journal_publications/index.html","excerpt":"","text":"Computer VisionMicroelectromechanical Systems2018 Tape nanolithography: a rapid and simple method for fabricating flexible, wearable nanophotonic devicesQiugu Wang, Weikun Han, Yifei Wang, Meng Lu and Liang DongMicrosystems and Nanengineering, 4, 31, 2018 2016 Strain-tunable plasmonic crystal using elevated nanodisks with polarization-dependent characteristicsYifei Wang, Longju Liu, Qiugu Wang, Weikun Han, Meng Lu and Liang DongApplied Physics Letters, 108, 071110, 2016 Electrically tunable quasi-3-D mushroom plasmonic crystalQiugu Wang, Weikun Han, Peng Liu, Liang DongJournal of Lightwave Technology, 34, 2175-2181 2016"},{"title":"Conference Publications","date":"2020-05-30T08:38:52.389Z","updated":"2020-05-30T08:38:52.389Z","comments":true,"path":"publications/conference_publications/index.html","permalink":"https://weikunhan.github.io/publications/conference_publications/index.html","excerpt":"","text":"Computer VisionMicroelectromechanical Systems2017 Tape-based flexible metallic and dielectric nanophotonic devices and metamaterialsQiugu Wang, Weikun Han, Yifei Wang, Meng Lu and Liang DongIEEE 17th International Conference on Nanotechnology (IEEE-NANO), 2017 Best Student Paper Award 2015 Strain-tunable two-dimensional plasmonic crystalsYifei Wang, Longju Liu, Qiugu Wang, Weikun Han, Meng Lu and Liang DongIEEE Photonics Conference (IPC), 2015"}],"posts":[{"title":"Biography","slug":"biography","date":"2020-06-03T00:56:30.020Z","updated":"2020-06-03T00:56:30.020Z","comments":true,"path":"2020/06/02/biography/","link":"","permalink":"https://weikunhan.github.io/2020/06/02/biography/","excerpt":"","text":"About Weikun Han is a computer vision scientist at Clobotics where he works on multiple computer vision tasks (image classification, object detection, semantic segmentation). Beside modeling many real-life challenging problems, he as machine learning engineer to work on many machine learning system design tasks (ceiling analysis dashboard, active learning pipeline, image retrieval system, distributed data pipeline, online learning pipeline), and he as software development engineer to work on many infrastructure development tasks (product search website, data operations platform). Weikun Han received an M.S. degree in electrical and computer engineering from UCLA, supervised by Prof. Lei He. He received a B.S. degree in electrical engineering from ISU, supervised by Prof. Liang Dong. He also received the IEEE NANO best student paper award, and he co-authored 5 publications in major journals and conferences during the undergraduate research study. Interests Machine Learning Deep Learning Computer Vision Education M.S., Electrical and Computer Engineering, University of California Los Angeles, 2018 B.S., Electrical Engineering, Iowa State University, 2016","categories":[],"tags":[]},{"title":"News","slug":"news","date":"2020-05-30T08:38:52.385Z","updated":"2020-05-30T08:38:52.385Z","comments":true,"path":"2020/05/30/news/","link":"","permalink":"https://weikunhan.github.io/2020/05/30/news/","excerpt":"","text":"News [6/1/2020] I will join Prof. Fuxin Li’s research group as research assistant intern at Oregon State University. Learn More [5/29/2020] I will resign from Clobotics Global. I am actively looking for a research group to keep proceeding with my Ph.D. study. Learn More","categories":[],"tags":[]}],"categories":[],"tags":[]}